{
    "name": "134 I 293",
    "paragraphs": [
        {
            "index": "2.",
            "links": [],
            "content": " Bei der Prüfung der Verfassungsmässigkeit eines kantonalen Erlasses im Rahmen der abstrakten Normenkontrolle ist nach der Rechtsprechung des Bundesgerichts massgebend, ob der betreffenden Norm nach anerkannten Auslegungsregeln ein Sinn beigemessen werden kann, der sie mit den angerufenen Verfassungsgarantien vereinbar erscheinen lässt. Das Bundesgericht hebt eine kantonale Norm nur auf, wenn sie sich jeder verfassungskonformen  Auslegung entzieht, nicht jedoch, wenn sie einer solchen in vertretbarer Weise zugänglich bleibt . Erscheint eine generell-abstrakte Regelung unter normalen Verhältnissen, wie sie der Gesetzgeber voraussetzen durfte, als verfassungsrechtlich zulässig, so vermag die ungewisse Möglichkeit, dass sie sich in besonders gelagerten Einzelfällen als verfassungswidrig auswirken könnte, ein Eingreifen des Verfassungsrichters im Stadium der abstrakten Normenkontrolle im Allgemeinen noch nicht zu rechtfertigen; den Betroffenen verbleibt die Möglichkeit, eine allfällige Verfassungswidrigkeit bei der Anwendung im Einzelfall geltend zu machen ."
        },
        {
            "index": "3.1",
            "links": [
                "BV_49",
                "SchKG_92",
                "ZGB_896",
                "ZGB_641a",
                "SchKG_92",
                "ZGB_896"
            ],
            "content": " Der Beschwerdeführer erblickt in der in §7a Abs.1 und 3 HundeG vorgesehenen Möglichkeit, zur Durchsetzung finanzieller Verpflichtungen des Hundehalters den Hund wegzunehmen und fremdzuplatzieren, einen Verstoss gegen den Vorrang des Bundesrechtes , da eine solche Regelung das in  bzw.  verankerte Pfändungs- und Retentionsverbot von Heimtieren missachte. Fällige Hundesteuern seien auf dem Betreibungswege einzutreiben, wobei die Nichtbezahlung dieser Abgabe trotz erfolgter Mahnung gemäss §17 HundeG zudem noch mit einer Busse bestraft werden könne. Nach dem seit 1.April 2003 in Kraft stehenden  seien Tiere keine Sache mehr und nur als solche zu behandeln, soweit keine besonderen Regelungen bestünden. Gemäss der gleichzeitig beschlossenen neuen Bestimmung von  seien Tiere, die im häuslichen Bereich und nicht zu Vermögens- oder Erwerbszwecken gehalten werden, unpfändbar, womit an solchen Tieren grundsätzlich auch kein Retentionsrecht mehr ausgeübt werden könne . Auch wenn die angefochtene kantonaleRegelung nicht darauf abziele, durch Verwertung des Hundes einen Erlös zu erzielen, kollidiere die Wegnahme eines unpfändbaren Tieres zur Erzwingung einer finanziellen Leistung doch mit der genannten Bestimmung des SchKG. Zwar werde nicht direkt der Hund gepfändet und zwecks Befriedigung des Gläubigers versilbert, doch werde der Schutz, den das Schuldbetreibungsrecht der Beziehung zwischen dem Hundehalter und seinem Tier zukommen lassen wolle, durch die beanstandete kantonale Gesetzgebung vereitelt."
        },
        {
            "index": "3.2",
            "links": [
                "SchKG_38",
                "SchKG_44",
                "BV_7",
                "BV_10"
            ],
            "content": " Geldforderungen sind auf dem Wege der Schuldbetreibung zu vollstrecken . Die Kantone sind nicht befugt, hierfür eigene Vollstreckungsmassnahmen vorzusehen . Das gilt grundsätzlich auch für öffentlich-rechtliche Geldforderungen; unmittelbar auf die Eintreibung solcher Forderungen ausgerichtete Vollstreckungsmassnahmen richten sich ausschliesslich nach den Bestimmungen des Schuldbetreibungsrechtes, soweit nicht besondere straf- oder fiskalrechtliche Bestimmungen über die Verwertung beschlagnahmter Gegenstände zum Zuge kommen . Für ein besonderes kantonales Vollstreckungsverfahren für öffentlich-rechtliche Geldforderungen besteht insoweit kein Raum . Dem zuständigen Gesetzgeber bleibt es aber unverwehrt, die Nichtbezahlung öffentlich-rechtlicher Forderungen – nebst allfälligen Verwaltungsstrafen – durch administrative Rechtsnachteile zu sanktionieren, um den Schuldner  auf diese Weise zu veranlassen, seiner Zahlungspflicht nachzukommen . Solche administrativen Sanktionen bedürfen in der Regel einer besonderen gesetzlichen Grundlage und müssen, was den mit dem Eingriff verbundenen Nachteil für den Betroffenen anbelangt, das Gebot der Verhältnismässigkeit respektieren . Die Nichterfüllung öffentlich-rechtlicher Geldforderungen kann insbesondere die Verweigerung von davon abhängigen bzw. im Austauschverhältnis zu erbringenden Verwaltungsleistungen nach sich ziehen. Diese Sanktion fällt namentlich in Betracht beim Verzug in der Bezahlung von Benutzungsgebühren, soweit es sich nicht um die Belieferung mit für den betroffenen Privaten lebenswichtigen Gütern wie etwa die Energie- und Wasserzufuhr handelt . Ebenso kann bei Nichtbezahlung der Gebühr für eine vorgeschriebene polizeiliche Kontrolle die entsprechende Bewilligung verweigert werden . Als unzulässig erachtete das Bundesgericht jedoch eine kantonale Vorschrift, wonach der Rückstand in der Bezahlung der Steuern die Einstellung im Stimmrecht nach sich zog . Ebenso wenig darf die Abmeldebestätigung durch die Einwohnerkontrolle von der Begleichung offener Steuerschulden abhängig gemacht werden . Gegen das Verbot des Schuldverhaftes  verstiess die in einem kantonalen Steuererlass vorgesehene Pflicht, unbezahlt gebliebene Militärsteuern durch Arbeitsleistung in einer Kaserne abzuverdienen , ebenso die Umwandlung von unbezahlten Prozesskosten in Haft ; ein blosses Wirtshausverbot für säumige Steuerschuldner galt dagegen als mit der genannten Garantie noch vereinbar ."
        },
        {
            "index": "3.3",
            "links": [
                "SVG_16",
                "SVG_68",
                "SVG_16",
                "SVG_16",
                "VVV_7",
                "SVG_16"
            ],
            "content": " Zur  Durchsetzung der Erfüllung von Abgabepflichten kann das Gesetz auch Massnahmen vorsehen, durch die demsäumigen Schuldner die  Benutzung bestimmter Sachen untersagt oder verunmöglicht wird. So kann etwa der Fahrzeugausweis  für ein Motorfahrzeug entzogen werden, wenn und solange der Halter die kantonalen Verkehrssteuern oder -gebühren nicht bezahlt hat  oder die erforderliche Haftpflichtversicherung nicht mehr besteht . Die Möglichkeit dieser Vorkehr sieht die Bundesgesetzgebung heute zudem für den Fall der Nichtbezahlung der Schwerverkehrsabgabe vor , um die Entrichtung dieser Abgaben auch gegenüber zahlungsunwilligen oder -unfähigen Unternehmern wirksam zu gewährleisten und Wettbewerbsverzerrungen im Transportgewerbe zu vermeiden ."
        },
        {
            "index": "4.1",
            "links": [
                "ZGB_896",
                "BV_49"
            ],
            "content": " Die angefochtene neue Regelung des thurgauischen Hundegesetzes, wonach ein Hund bei Nichterfüllung der dem Halter aus der Hundehaltung erwachsenden finanziellen Verpflichtungen eingezogen und fremdplatziert werden kann, stellt keine unmittelbar der Vollstreckung der Geldleistungspflicht dienende Massnahme dar; insbesondere wird der Hund nicht zwecks Verwertung behändigt, sondern lediglich als  Druckmittel der Obhut des Halters entzogen. Die angefochtene Gesetzesbestimmung greift insoweit nicht in den Regelungsbereich des Schuldbetreibungsrechtes ein, sondern will im Sinne eines administrativen Rechtsnachteils den säumigen Hundehalter indirekt zur Erfüllung seiner finanziellen Verpflichtungen veranlassen. Dies wird an sich auch vom Beschwerdeführer eingeräumt. Er hält aber dafür, dass die vom kantonalen Gesetzgeber für den Fall der Nichterfüllung finanzieller Verpflichtungen vorgesehene Möglichkeit der Konfiszierung von Hunden angesichts des heute für Heimtiere gemäss Art.92 Abs.1 Ziff.1aSchKG bzw.  geltenden Pfändungs- und Retentionsverbotes gegen Sinn und Geist des Bundesrechts und damit gegen  verstosse."
        },
        {
            "index": "4.2",
            "links": [
                "ZGB_641a",
                "BV_49"
            ],
            "content": " Im Zuge der neuen zivilrechtlichen Regelung über den Status der Tiere  wurden Heimtiere, die vom Schuldner nicht zu Vermögens- oder Erwerbszwecken gehalten werden, im Hinblick auf die oftmals starken emotionalen Bindungen zwischen Mensch und Tier und auf den meist geringen, zum affektiven Wert in keinem Verhältnis stehenden Verwertungserlös von der Möglichkeit der Pfändung und Verwertung ausgenommen . Diese schuldbetreibungsrechtliche Regelung schliesst anderweitige rechtliche Schranken, welche der Tierhaltung entgegenstehen können, nicht aus; sie garantiert weder ein absolutes Recht auf Haltung von Heimtieren noch befreit sie von der Erfüllung der mit der Tierhaltung verbundenen finanziellen  Verpflichtungen gegenüber dem Staat und Dritten. Das vom Beschwerdeführer angerufene bundesrechtliche Pfändungs- und Retentionsverbot für Heimtiere besagt lediglich, dass Heimtiere nicht zur Befriedigung von Geldforderungen  der Zwangsverwertung zugeführt werden dürfen; es schliesst nicht aus, dass der zuständige Gesetzgeber die Nichterfüllung der mit der Tierhaltung verbundenen finanziellen  Pflichten durch administrative Rechtsnachteile und Verwaltungsstrafen sanktioniert, wie dies nach dem Gesagten auch in anderen Regelungsbereichen der Fall sein kann. Schranken für solche Massnahmen ergeben sich nicht aus dem Schuldbetreibungsrecht, sondern vorab aus allenfalls berührten Grundrechten. Es ist ferner auch nicht ersichtlich und rechtsgenüglich dargetan, inwiefern die angefochtene kantonale Gesetzesbestimmung gegen die eidgenössische Tierschutzgesetzgebung verstossen soll. Die Rüge der Verletzung von  vermag nicht durchzudringen."
        },
        {
            "index": "5.",
            "links": [
                "BV_10",
                "BV_26",
                "BV_9",
                "BV_8"
            ],
            "content": " Zu prüfen bleibt, ob die streitige Regelung vor den angerufenen Grundrechten standhält. Der Beschwerdeführer erblickt in der vorgesehenen Möglichkeit, Hunde wegen Nichterfüllung finanzieller Verpflichtungen zu beschlagnahmen, einen Verstoss sowohl gegen die persönliche Freiheit  und dieEigentumsgarantie  wie auch gegen das Willkürverbot  und die Rechtsgleichheit ."
        },
        {
            "index": "5.1",
            "links": [
                "BV_36"
            ],
            "content": " Die angefochtenen Bestimmungen sind in einem formellen Gesetz enthalten. Das Erfordernis der gesetzlichen Grundlage  ist damit erfüllt."
        },
        {
            "index": "5.2",
            "links": [
                "BV_10",
                "BV_36"
            ],
            "content": " Die Beschlagnahme eines Hundes, zu dem der Halter eine enge emotionale Beziehung hat, kann einen Eingriff in das Grundrecht der persönlichen Freiheit darstellen , was alsdann voraussetzt, dass überwiegende öffentliche Interessen die Massnahme rechtfertigen und als verhältnismässig erscheinen lassen ."
        },
        {
            "index": "5.2.1",
            "links": [],
            "content": " Die Wegnahme und allfällige  Fremdplatzierung eines Hundes zur Erzwingung der Bezahlung bzw. als administrative Sanktion für die Nichtbezahlung einer relativ niedrigen Geldforderung des Staates erscheint unter dem Gesichtswinkel der persönlichen Freiheit in der Tat nicht unproblematisch. Die affektive Beziehung zu Heimtieren gilt nach heutiger Anschauung als schützenswertes Rechtsgut, was unter anderem im vom Bundesgesetzgeber beschlossenen Pfändungs- und Retentionsverbot für solche Tiere zum Ausdruck kommt. Auch der kantonale Gesetzgeber kann sich beim Erlass von Vorschriften, welche die Wegnahme und Konfiszierung von Hunden vorsehen, über diesen Aspekt nicht hinwegsetzen. Dass solche Massnahmen den Schutzbereich der persönlichen Freiheit des Halters berühren können, schliesst ihre Zulässigkeit aber noch nicht aus. Das steht ausser Frage, soweit es sich um Massnahmen gegen gefährliche Hunde handelt, die vorrangige Anliegen der öffentlichen Sicherheit verfolgen, denen gegenüber das persönliche Interesse des Halters zurückzutreten hat. Neben sicherheitspolizeilichen können aber auch andere öffentliche Interessen genügend Gewicht besitzen, um die Wegnahme eines Tieres zu rechtfertigen, so namentlich Gründe des Tierschutzes oder der Schutz der Umgebung vor unzumutbaren Belästigungen."
        },
        {
            "index": "5.2.2",
            "links": [],
            "content": " Soweit die in der vorliegend angefochtenen Gesetzesbestimmung vorgesehene Sanktion der Wegnahme und allfälligen Fremdplatzierung eines Hundes bezweckt, den Halter zum Abschluss der vorgeschriebenen Haftpflichtversicherung zu veranlassen , dient dieses administrative Druckmittel der Erfüllung einer wesentlichenSachverpflichtung, welche einen allfälligen Eingriff in die persönliche Freiheit des Halters zu rechtfertigen vermag. Grundsätzlich dasselbe gilt, wenn mit der erwähnten Sanktion erzwungen werden soll, dass ein Halter für den Kostenvorschuss oder die Kosten für im Zusammenhang mit seiner Hundehaltung stehende Kontroll- oder Abwehrmassnahmen aufkommt . Auch hier geht es nicht in erster Linie um ein blosses fiskalisches Interesse, sondern um die Wahrung von potentiell vorrangigen öffentlichen Sachinteressen."
        },
        {
            "index": "5.2.3",
            "links": [],
            "content": " Dieser Erkenntnis verschliesst sich auch der Beschwerdeführer nicht völlig, indem er der Regelung des kantonalen Gesetzgebers in den soeben genannten beiden Punkten ein «gewisses Verständnis» entgegenbringt. Er stösst sich vor allem daran, dass die Beschlagnahme als Mittel zur Eintreibung der Hundesteuer sowie der Rechnung des Tierarztes für die Kennzeichnung verwendet werden kann, und verlangt eventualiter wenigstens die Streichung der betreffenden beiden Gesetzesbestimmungen von §7a Abs.2 Ziff.3 und 4, wo es um rein finanzielle Verpflichtungen und relativ geringe Beträge gehe. Zudem handle es sich bei den Kosten der Kennzeichnung um eine zivilrechtliche Forderung des Tierarztes, deren Durchsetzung keine staatliche Privilegierung verdiene; für die Eintreibung dieser Forderung durch eine Verfügung der Gemeinde fehle es an einer gesetzlichen Grundlage."
        },
        {
            "index": "5.2.4",
            "links": [],
            "content": " Im Übrigen war, wie das Protokoll der Beratungen zeigt, auch der Gesetzgeber sich der Problematik des vorgesehenen Druckmittels bewusst. Eine Bestimmung, welche bei finanzieller Säumnis des Halters nebst der Fremdplatzierung auch die Möglichkeit der Tötung des Hundes vorsah, wurde vom Parlament fallen gelassen. In der Vernehmlassung des Regierungsrates wird ausgeführt, es gehe bei dieser Bestimmung nicht darum, einer unterstützungsbedürftigen Person den einzigen Hund, zu dem sie eine emotionaleBeziehung habe, wegzunehmen, weil sie die Hundesteuer nicht bezahlen könne. Es dürfe aber nicht sein, dass ausgepfändete Personen mehrere Hunde halten könnten, ohne für die Hundesteuer aufkommen zu müssen, da Betreibungen regelmässig zu einem Verlustschein führten."
        },
        {
            "index": "5.3",
            "links": [],
            "content": " Aus der mitangerufenen Eigentumsgarantie ergeben sich unter dem Gesichtswinkel des öffentlichen Interesses und der Verhältnismässigkeit, auf welche beiden Kriterien der Beschwerdeführer einzig Bezug nimmt, keine weitergehenden Schranken, ebenso wenig aus dem Willkürverbot und dem Rechtsgleichheitsgebot."
        }
    ]
}